OpenFOAM-3.0.1/chapter7/spillWay/0.org/alpha.water.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            variableHeightFlowRate; // it does not work for OpenFOAM-2.1.1
        lowerBound      0.0;
        upperBound      0.9;
        value           uniform 0;
        /*type	groovyBC;
 	valueExpression "pos().y < 0.0 ? 1.0 : 0";
	gradientExpression "0";
	fractionExpression "1";
	variables       "";
	timelines       ();
	value           uniform 0;*/
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }
    spillway
    {
        type            zeroGradient;
    }
   
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

     "(defaultFaces|front|back)"
    {
        type            empty;
    }
}

// ************************************************************************* //
