OpenFOAM-3.0.1/chapter7/spillWay/Allrun
#!/bin/bash


rm -rf 0
cp -r 0.org 0
cp 0/alpha.water.org 0/alpha.water
setFields 
interFoam
#decomposePar
#mpirun -np 4 interFoam -parallel > interFoam.log 
#reconstructPar

